<?php

return [
    'welcome' => 'Добро пожаловать в бот, :name. Бот поможет вам отслеживать ваши финансы. Выберите нужное вам меню ниже',
    'start' => 'Вы в главном меню',
    'help' => 'Типа помощь',
    'show_actions' => 'Выберите какие добавленные отчеты вы хотите посмотреть:',
    'show_incomes' => 'Ваши добавленные отчеты о доходах:

:actions',

    'show_expenses' => 'Ваши добавленные отчеты о расходах:

:actions',

    'expenses.menu' => 'Тут вы можете добавить свои расходы в течении дня.

Добавьте сумму в виде цифр. Например: 990',

    'incomes.menu' => 'Тут вы можете добавить свои доходы в течении дня.

Добавьте сумму в виде цифр. Например: 9900',

    'expenses.choose_category' => 'Пожалуйста выберите категорию вашего отчета о расходе',
    'expenses.set_description' => 'Пожалуйста введите описание вашего расхода до 50 символов. Если хотите оставить пустым, просто отправьте 0',
    'expenses.success' => 'Новый отчет о расходе добавлен!',


    'incomes.choose_category' => 'Пожалуйста выберите категорию вашего отчета о доходе',
    'incomes.set_description' => 'Пожалуйста введите описание вашего отчета о доходе  до 50 символов. Если хотите оставить пустым, просто отправьте 0',
    'incomes.success' => 'Новый отчет о доходе добавлен!',

    'profile' => 'это ваш кабинет',
    'numeric_pls' => 'Пожалуйста введите число',
    'limit_description' => 'Пожалуйста, введите описание вашего действия короче 50 символов',
    'invalid_format' => 'Неправильный формат, пожалуйста соблюдайте правила',
    'unknown' => 'Бот вас не понимает, пожалуйста действуйте по указанию',
    'unknown_error' => 'Неизвестная ошибочка 🙃',
    'nothing' => 'Там ничего нет😑',

    //Keyboard texts
    'kbd.main' => 'Главное меню 🏠',
    'kbd.add_incomes' => 'Добавить доход',
    'kbd.add_expense' => 'Добавить расход',
    'kbd.cancel' => 'Отмена ⤵',
    'kbd.done' => 'Готово ✅',
    'kbd.delete' => 'Удалить ❌',
    'kbd.back' => 'Назад 🔙',
    'kbd.help' => 'Помощь ❓',
    'kbd.profile' => 'Профиль ⚙',
    'kbd.select' => 'Выберите меню ниже',
    'kbd.close' => 'Закрыт ❌',
    'kbd.notification' => 'Уведомление :status',
    'kbd.show_recent_actions' => 'Мои транзакции',
    'kbd.show.incomes' => 'Мои отчеты о доходах',
    'kbd.show.expenses' => 'Мои отчеты о расходах',

    //Категория доходов и расходов
    'expenses.category.food' => 'еда',
    'expenses.category.transport' => 'транспорт',
    'expenses.category.housing' => 'жилье',
    'expenses.category.health' => 'здоровье',
    'expenses.category.travel' => 'путешествие',
    'expenses.category.education' => 'образование',
    'expenses.category.hobbies' => 'хобби',
    'expenses.category.gifts' => 'подарки',
    'expenses.category.electronics' => 'электроника',
    'expenses.category.etc' => 'прочее',

    'incomes.category.salary' => 'Зарплата',
    'incomes.category.sales' => 'Продажи',
    'incomes.category.etc' => 'Прочее',

];
